Tekla Open API Reference for Tekla Structures 2025
ShapeItem.GeometryGuid Property
 A unique identifier of the shape geometry, given initially by BrepStorage. This GUID is used as the body of the filename for the shape geometry information found in the ShapeGeometries directory
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GeometryGuid { get; }
Public ReadOnly Property GeometryGuid As String
	Get
Property Value
Type: String
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace